{
  "metadata": {
    "id": "ataque-descoberto",
    "title": "Táticas: O Ataque Descoberto",
    "description": "Aprenda a desvendar o poder do ataque descoberto, uma tática sutil e devastadora onde uma peça sai do caminho para revelar um ataque de outra.",
    "level": "intermediate",
    "author": "ChessKid & Chess.com (Adaptado)",
    "version": "1.0.0",
    "tags": ["tática", "ataque descoberto", "xeque descoberto", "ameaça oculta"]
  },
  "slides": [
    {
      "title": "O que é um Ataque Descoberto?",
      "content": "Um **ataque descoberto** ocorre quando uma peça se move e abre uma linha para outra peça aliada atacar uma peça inimiga. A peça que se move pode simultaneamente criar uma segunda ameaça. Essencialmente, são duas ameaças criadas com um único movimento: uma pela peça que se move e outra pela peça 'descoberta'.",
      "notes": "Esta tática é poderosa porque o oponente pode ficar sobrecarregado ao tentar defender duas ameaças de uma só vez."
    },
    {
      "title": "Xeque Descoberto: A Variante Mais Forte",
      "content": "O tipo mais forte de ataque descoberto é o **xeque descoberto**. Nele, o ataque revelado é um xeque ao rei adversário. Como o oponente é obrigado a responder ao xeque, a peça que se moveu fica livre para capturar outra peça ou criar outra ameaça impunemente.",
      "examples": [
        {
          "name": "Armadilha 'Copy Cat'",
          "moves": "5.Nc6+!!",
          "description": "Nesta armadilha de abertura, o Cavalo em e5 se move para c6. Este lance cria um xeque descoberto devastador: a Dama em e2 ataca o Rei preto, enquanto o Cavalo que se moveu agora ataca a Dama preta em d8. O preto é forçado a sair do xeque, permitindo que as brancas capturem a Dama inimiga.",
          "pgn": "[FEN \"r1bqkbnr/pppp1ppp/8/4N3/4n3/8/PPPPQPPP/RNB1KB1R b KQkq - 1 4\"] 1...Nxe2 2.Nxd8",
          "difficulty": "medium"
        }
      ]
    },
    {
      "title": "O Moinho de Vento (The Windmill)",
      "content": "Uma das aplicações mais famosas do xeque descoberto é a tática do 'Moinho de Vento'. Nela, uma Torre e um Bispo trabalham juntos para criar uma série contínua de xeques descobertos, permitindo que a Torre capture várias peças inimigas enquanto o Rei adversário fica preso, movendo-se para frente e para trás.",
      "examples": [
        {
          "name": "Torre vs. Lasker (1925)",
          "moves": "26.Rxg7+ Kh8 27.Rxf7+",
          "description": "Após um sacrifício de Dama, Carlos Torre (Brancas) executa um moinho de vento. A Torre em g7 e o Bispo em f6 criam xeques descobertos repetidos. A cada movimento, a Torre captura uma peça (...Rxf7+, ...Rxb7+, etc.) e volta para g7, mantendo o Rei preso e ganhando material decisivo.",
          "pgn": "[FEN \"r2q3r/p1p2R1p/5B2/8/2B1p3/2N5/PPP2PPP/R3K2R b KQkq - 0 25\"] 1...Kg8 2.Rg7+ Kh8 3.Rxb7",
          "difficulty": "hard"
        }
      ]
    }
  ],
  "settings": {
    "autoAdvance": false,
    "showMoveNumbers": true,
    "boardTheme": "standard"
  }
}
