{
  "metadata": {
    "id": "ataque-duplo-geral",
    "title": "Táticas: O Ataque Duplo",
    "description": "Aprenda o princípio geral do ataque duplo, onde uma única peça cria duas ameaças simultâneas no tabuleiro.",
    "level": "intermediate",
    "author": "Chess.com (Adaptado)",
    "version": "1.1.0",
    "tags": ["tática", "ataque duplo", "ameaça dupla", "peças desprotegidas"]
  },
  "slides": [
    {
      "title": "O que é um Ataque Duplo?",
      "content": "O **Ataque Duplo** é uma tática fundamental onde um único lance cria **duas ou mais ameaças** simultaneamente. As ameaças não se limitam a atacar peças; podem incluir uma ameaça de xeque-mate, tornando a defesa ainda mais difícil. Qualquer peça pode executar um ataque duplo.",
      "notes": "O ataque duplo é uma das formas mais eficazes de ganhar material ou decidir uma partida."
    },
    {
      "title": "Por que o Ataque Duplo é tão Poderoso?",
      "content": "Sua força reside na dificuldade que impõe ao adversário. Como um jogador só pode fazer um lance por vez, defender-se de duas ameaças distintas com um único movimento é, muitas vezes, impossível. A chave para criar ataques duplos é **identificar as peças desprotegidas** do oponente e usá-las como alvos.",
      "examples": [
        {
          "name": "Armadilha com a Dama",
          "moves": "5.Qa4+",
          "description": "A Dama branca move-se para a4, criando um ataque duplo clássico. Ela dá um xeque no Rei em e8 (ameaça 1) e ataca o Cavalo desprotegido em e4 (ameaça 2). As pretas são forçadas a resolver o xeque, permitindo que as brancas capturem o Cavalo no lance seguinte.",
          "pgn": "[FEN \"r1bqkbnr/pp1ppppp/2n5/2p5/4n3/2N2N2/PPPP1PPP/R1BQKB1R w KQkq - 0 4\"] 1.Qa4+",
          "difficulty": "medium"
        }
      ]
    },
    {
      "title": "Ataques Duplos em Nível de Mestre",
      "content": "Grandes mestres usam o ataque duplo para finalizar partidas. Muitas vezes, um sacrifício é usado para abrir a posição e criar uma oportunidade de ataque duplo devastadora, forçando o oponente a abandonar.",
      "examples": [
        {
          "name": "A Torre Cria a Ameaça Dupla",
          "moves": "1.Rxd7!",
          "description": "Neste exemplo, as Brancas jogam Rxd7. A Torre agora ataca a Dama em c7 e o Bispo em f7. A Dama preta não pode se mover e continuar defendendo o Bispo. Este ataque duplo garante uma vantagem material decisiva.",
          "pgn": "[FEN \"5rk1/p1qb1ppp/8/8/8/8/P4PPP/2R2RK1 w - - 0 1\"] 1.Rxd7",
          "difficulty": "hard"
        }
      ]
    }
  ],
  "settings": {
    "autoAdvance": false,
    "showMoveNumbers": true,
    "boardTheme": "standard"
  }
}
