{
  "metadata": {
    "id": "o-garfo-no-xadrez",
    "title": "Táticas: O Garfo",
    "description": "Domine o garfo, a forma mais famosa de ataque duplo. Aprenda como qualquer peça, especialmente o Cavalo, pode se tornar uma arma letal ao atacar múltiplas peças de uma só vez.",
    "level": "beginner",
    "author": "Chess.com (Adaptado)",
    "version": "1.1.0",
    "tags": ["tática", "garfo", "cavalo", "peão", "ataque duplo"]
  },
  "slides": [
    {
      "title": "O que é um Garfo?",
      "content": "Um **Garfo** é uma tática onde uma única peça ataca duas ou mais peças adversárias ao mesmo tempo. É uma das formas mais comuns de ganhar material. Embora o **Cavalo** seja a peça mais famosa por aplicar garfos, **qualquer peça do xadrez pode fazê-lo**, incluindo Reis, Damas, Torres, Bispos e até mesmo Peões.",
      "notes": "Um garfo de peão é particularmente eficaz, pois ataca peças de maior valor com a peça de menor valor."
    },
    {
      "title": "O Garfo 'Mortal' com Xeque",
      "content": "O tipo de garfo mais poderoso é aquele que inclui um **xeque ao Rei**. Como o oponente é **obrigado por regra** a sair do xeque, a outra peça atacada fica indefesa e será capturada no próximo lance. Sempre procure por oportunidades de aplicar um garfo que também ameace o Rei.",
      "examples": [
        {
          "name": "Garfo Clássico de Cavalo",
          "moves": "1.Nf7+",
          "description": "O Cavalo branco salta para f7, aplicando um garfo no Rei em e5 (xeque) e na Dama em d8. O Rei preto deve se mover, permitindo que as brancas capturem a Dama com 2.Nxd8.",
          "pgn": "[FEN \"3q4/8/8/4k3/8/8/8/5N1K w - - 0 1\"] 1.Nf7+",
          "difficulty": "easy"
        }
      ]
    },
    {
      "title": "Sacrifício para Criar um Garfo",
      "content": "Às vezes, é necessário sacrificar uma peça de alto valor, como a Dama, para forçar a criação de um garfo vencedor. Esta é uma ideia tática avançada que demonstra a verdadeira força do garfo.",
      "examples": [
        {
          "name": "Petrosian vs. Spassky (1966)",
          "moves": "1.Qxf6+!!",
          "description": "Nesta famosa partida, Tigran Petrosian (Brancas) sacrifica sua Dama com Qxf6+. Após a captura forçada ...gxf6, o Cavalo branco aplica um garfo com 2.Ne4+, atacando o Rei e a Dama preta, ganhando a partida.",
          "pgn": "[FEN \"5r1k/p1p1r2p/5R2/8/4n3/8/P1P3PP/5R1K w - - 0 1\"] 1.Qxf6+",
          "difficulty": "hard"
        }
      ]
    }
  ],
  "settings": {
    "autoAdvance": false,
    "showMoveNumbers": true,
    "boardTheme": "standard"
  }
}
