{
  "metadata": {
    "id": "xeque-duplo",
    "title": "Táticas: O Xeque Duplo",
    "description": "Conheça a tática mais poderosa do xadrez: o xeque duplo. Entenda por que essa ameaça dupla força o Rei a se mover e como usá-la para criar mates espetaculares.",
    "level": "advanced",
    "author": "ChessKid & Chess.com (Adaptado)",
    "version": "1.0.0",
    "tags": ["tática", "xeque duplo", "xeque-mate", "mate sufocado"]
  },
  "slides": [
    {
      "title": "O que é o Xeque Duplo?",
      "content": "O **xeque duplo** é um tipo especial de xeque descoberto onde **ambas as peças** — a que se move e a que é revelada — dão xeque ao Rei adversário ao mesmo tempo. É considerada a tática mais forte do jogo, pois a única maneira de escapar de um xeque duplo é **movendo o Rei**. Não é possível bloquear duas direções de ataque ou capturar as duas peças agressoras de uma só vez.",
      "notes": "Por forçar o movimento do Rei, o xeque duplo é uma ferramenta incrível para forçar sequências de xeque-mate."
    },
    {
      "title": "Mate Sufocado (Venus Fly Trap)",
      "content": "Uma das demonstrações mais famosas do poder do xeque duplo é a combinação do 'Mate Sufocado'. A sequência geralmente envolve um sacrifício de Dama para forçar o Rei inimigo a ficar preso por suas próprias peças, culminando em um xeque duplo que o leva a uma casa onde será sufocado por um Cavalo.",
      "examples": [
        {
          "name": "A Armadilha da Mosca de Vênus",
          "moves": "2.Nh6++",
          "description": "As Brancas jogam Nh6, aplicando um xeque duplo com o Cavalo e a Dama em d5. O Rei é forçado a ir para h8 (a única casa segura). Isso permite que as Brancas continuem com o sacrifício 3.Qg8+ Rxg8, seguido pelo mate sufocado 4.Nf7#.",
          "pgn": "[FEN \"q3r2k/p5pp/8/3Q2N1/8/8/P5PP/7K w - - 1 2\"] 1.Nh6+ Kh8 2.Qg8+ Rxg8 3.Nf7#",
          "difficulty": "hard"
        }
      ]
    },
    {
      "title": "Sacrifício para Forçar o Mate",
      "content": "Muitas das mais belas combinações de xadrez usam sacrifícios para atrair o Rei adversário para uma 'rede de mate', onde um xeque duplo pode ser aplicado. A tática de **atração** força uma peça a se mover para uma casa desfavorável, preparando o golpe final.",
      "examples": [
        {
          "name": "Sacrifício de Dama para o Xeque Duplo",
          "moves": "1...Qf1+!!",
          "description": "As Pretas sacrificam a Dama para atrair o Rei branco para f1. Após a captura forçada 2.Kxf1, as Pretas jogam 2...Bd3++, um xeque duplo do Bispo e da Torre em f8. O Rei é forçado a voltar para e1, onde leva o mate com 3...Rf1#.",
          "pgn": "[FEN \"r1b2r1k/p1p3pp/2p5/8/2Q5/8/P1P2PPP/R3K1NR b KQ - 0 1\"] 1...Qf1+ 2.Kxf1 Bd3+ 3.Ke1 Rf1#",
          "difficulty": "hard"
        }
      ]
    }
  ],
  "settings": {
    "autoAdvance": false,
    "showMoveNumbers": true,
    "boardTheme": "standard"
  }
}
